"use client";

import React from "react";
import { useState, useEffect } from "react";

// eslint-disable-next-line @typescript-eslint/no-explicit-any
function LMAssessment(datainf: any) {
  const [data, setDataGet] = useState<string[]>([]);
  //قائمة المعايير
  const [firstHederRow, setfirstHederRow] = useState<string[]>([]);
  //مصفوفة التقيم
  const [contents, setContents] = useState<string[][]>([]);
  //عدد خلايا التقييم
  const [numberCell, setnumberCell] = useState<number>();
  //قائمة الأسماء
  const [listNames, setlistNames] = useState<string[]>([]);
  //عناوين المعايير
  const [criteria, setCriteria] = useState<string[]>([]);

  const [criteriaNum, setcriteriaNum] = useState<number>(0);
  const colorMap = {
    أ: "bg-green-500 text-white",
    ب: "bg-green-200 text-black",
    ج: "bg-yellow-300 text-black",
    د: "bg-red-500 text-white",
  };

  useEffect(() => {
    const dataGet: StudentData = Object.values(datainf)[0] as StudentData;
    const title = Object.keys(
      Object.values(Object.values(dataGet)[criteriaNum])[0]
    );
    const criteriaTitle = Object.keys(dataGet);
    setCriteria(criteriaTitle);
    // console.log("criteriaTitle", criteriaTitle);
    setDataGet(title);

    const names = Object.keys(Object.values(dataGet)[criteriaNum]);

    setlistNames(names);

    function fillFirstRow() {
      const rowData = [];
      for (let i = 0; i < title.length - 1; i++) {
        rowData.push("المعيار " + (i - 2));
      }
      rowData.push("تملك الكفاءات");
      setfirstHederRow(rowData);
    }
    setnumberCell((title.length - 4) * 4 + 4);

    fillFirstRow();

    //----------------------------------------------------------
    const tableContents: string[][] = Object.values(
      Object.values(dataGet)[criteriaNum]
    ).map((item: { [key: string]: string }) => {
      return Object.values(item).filter((_, index) => index > 3);
    });
    // console.log(tableContents);
    // const mapping = { أ: 0, ب: 1, ج: 2, د: 3 };

    // const result = tableContents.map((row, i) => {
    //   const res = row.map((char) => {
    //     const group = Array(4).fill("");
    //     const index = mapping[char as keyof typeof mapping];
    //     if (index !== undefined) group[index] = "×";
    //     return group;
    //   }).flat();

    //   return res;
    // });
    const mapping = { أ: 0, ب: 1, ج: 2, د: 3 };

    const result = tableContents.map((row) => {
      // نقوم بإنشاء مصفوفة تحتوي على 4 خلايا فارغة في البداية
      const res = row
        .map((char) => {
          const group = Array(4).fill(""); // إنشاء مصفوفة تحتوي على 4 خلايا فارغة
          const index = mapping[char as keyof typeof mapping]; // الحصول على مكان الحرف في الماب

          if (index !== undefined) group[index] = "×"; // تعيين "×" في الموقع المحدد
          return group;
        })
        .flat(); // جعل المصفوفة مسطحة لتصبح مصفوفة مكونة من خلايا متعددة بدلاً من مصفوفة مصفوفات.

      // الآن نضيف 4 خلايا جديدة بعد الحساب
      res.push(...Array(4).fill("")); // إضافة 4 خلايا جديدة تحتوي على "×"

      return res;
    });

    setContents(result);
  }, [criteriaNum, datainf]);

  const handleSelect = (index: number) => {
    setcriteriaNum(index);
  };

  return (
    <div>
      <div>
        <ComboCriteria criteria={criteria} SelectNumber={handleSelect} />
      </div>
      <div>
        <ArabicForm />
      </div>
      <table
        dir="rtl"
        className="table-fixed border-collapse bg-white border border-black text-black w-full"
      >
        <thead>
          <tr>
            <th
              className="border-2 border-black p-2 w-fit rotate-[270deg]"
              rowSpan={3}
            >
              الرقم
            </th>
            <th rowSpan={3} className="border-2 border-black p-2 w-1/12">
              الاسم واللقب
            </th>
            {firstHederRow.map(
              (item, index) =>
                index > 2 && (
                  <th
                    colSpan={4}
                    key={index}
                    className="  border-2 border-black p-1"
                  >
                    {item}
                  </th>
                )
            )}
            <th className="border-2 border-black p-2 w-2/12" rowSpan={3}>
              الملاحظات
            </th>
          </tr>
          <tr>
            {data.map(
              (item, index) =>
                index > 3 && (
                  <th
                    colSpan={4}
                    key={index}
                    className="  border-2 border-black p-2"
                  >
                    {item}
                  </th>
                )
            )}
            {levels.map((level, index) => (
              <th
                key={index}
                className="border border-black w-10 h-32 text-center align-middle"
              >
                <div className="flex items-center justify-center rotate-[270deg] whitespace-nowrap h-full">
                  {level}
                </div>
              </th>
            ))}
          </tr>
          <tr>
            {Array.from({ length: numberCell || 0 }, (_, i) => (
              <td
                key={i}
                className={`border-2 border-black p-2 text-center ${
                  colorMap[
                    i % 4 === 0
                      ? "أ"
                      : i % 4 === 1
                      ? "ب"
                      : i % 4 === 2
                      ? "ج"
                      : "د"
                  ]
                }`}
              >
                {i % 4 === 0
                  ? "أ"
                  : i % 4 === 1
                  ? "ب"
                  : i % 4 === 2
                  ? "ج"
                  : "د"}
              </td>
            ))}
          </tr>
        </thead>
        <tbody>
          {/* <td className="border-2 border-black p-2">1</td> */}
          {/* {listNames.map((item, index) => (
            <tr key={index} className="border-2 border-black p-2">
              <td className="border-2 border-black p-2">{index+1}</td>
              <td>{item}</td>
              
              {contents.map((row, rowIndex) => (
                <React.Fragment key={rowIndex}>
                  {row.map((cell: string, cellIndex: number) => (
                    <td
                      key={cellIndex}
                      className={`border-2 border-black p-2 ${
                        colorMap[cell as keyof typeof colorMap] || ""
                      }`}
                    >
                      {cell}
                    </td>
                  ))}
                </React.Fragment>
              ))}
              <td className="border-2 border-black p-2"></td>
            </tr>
          ))} */}
          {listNames.map((item, index) => {
            const row = contents[index] || []; // خذ الصف المطابق من المحتوى

            return (
              <tr key={index} className="border-2 border-black">
                <td className="border-2 border-black p-2">{index}</td>
                <td className="border-2 border-black p-2">{item}</td>

                {row.map((cell, cellIndex) => (
                  <td
                    key={cellIndex}
                    className={`border-2 border-black p-2  text-center ${
                      colorMap[cell as keyof typeof colorMap] || ""
                    }`}
                  >
                    {cell}
                  </td>
                ))}

                <td className="border-2 border-black p-2"></td>
              </tr>
            );
          })}
        </tbody>
      </table>
    </div>
  );
}

export default LMAssessment;

const levels = ["تحكم أقصى", "تحكم مقبول", "تحكم جزئي", "تحكم محدود"];

interface StudentData {
  [key: string]: {
    [key: string]: {
      [key: string]: string;
    };
  };
}

//قائمة منسدلة لمعايير تقييم المكتسبات
//   "خ 1 - فهم الخطاب والتواصل الشف": {
//     "أحثريب ندى": {
//       "رقم التعريف": "1101539010273900",
//       اللقب: "أحثريب",
//       الاسم: "ندى",
//       "تاريخ الميلاد": "2015-03-20",
//       "الالتزام بآداب الاستماع والتحدّث": "ج",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "د",
//       "التجاوب مع التعليمات": "د",
//       "الاسترسال وسلامة لغة التّواصل ": "ج",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "د",
//     },
//     "أحموده هيثم": {
//       "رقم التعريف": "1001539010097600",
//       اللقب: "أحموده",
//       الاسم: "هيثم",
//       "تاريخ الميلاد": "2015-01-21",
//       "الالتزام بآداب الاستماع والتحدّث": "د",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "د",
//       "التجاوب مع التعليمات": "د",
//       "الاسترسال وسلامة لغة التّواصل ": "د",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "د",
//     },
//     "بالاخضر رائد": {
//       "رقم التعريف": "1001539110068900",
//       اللقب: "بالاخضر",
//       الاسم: "رائد",
//       "تاريخ الميلاد": "2015-07-11",
//       "الالتزام بآداب الاستماع والتحدّث": "أ",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "أ",
//       "التجاوب مع التعليمات": "أ",
//       "الاسترسال وسلامة لغة التّواصل ": "ب",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "ب",
//     },
//     "بالهادي أحمد طه أديب": {
//       "رقم التعريف": "1001539110130600",
//       اللقب: "بالهادي",
//       الاسم: "أحمد طه أديب",
//       "تاريخ الميلاد": "2015-12-22",
//       "الالتزام بآداب الاستماع والتحدّث": "أ",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "أ",
//       "التجاوب مع التعليمات": "أ",
//       "الاسترسال وسلامة لغة التّواصل ": "أ",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "أ",
//     },
//     "بالهادي ريان قدوس": {
//       "رقم التعريف": "1001539110139800",
//       اللقب: "بالهادي",
//       الاسم: "ريان قدوس",
//       "تاريخ الميلاد": "2015-02-07",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "بعطوط جمال": {
//       "رقم التعريف": "1001439010818000",
//       اللقب: "بعطوط",
//       الاسم: "جمال",
//       "تاريخ الميلاد": "2014-11-03",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "بعطوط لؤي": {
//       "رقم التعريف": "1001539120091200",
//       اللقب: "بعطوط",
//       الاسم: "لؤي",
//       "تاريخ الميلاد": "2015-11-19",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "حمدان تميم": {
//       "رقم التعريف": "1001439010746000",
//       اللقب: "حمدان",
//       الاسم: "تميم",
//       "تاريخ الميلاد": "2014-10-13",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "حمدان محمد زياد": {
//       "رقم التعريف": "1001439010751100",
//       اللقب: "حمدان",
//       الاسم: "محمد زياد",
//       "تاريخ الميلاد": "2014-10-18",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "خالدي زياد": {
//       "رقم التعريف": "1001539110056700",
//       اللقب: "خالدي",
//       الاسم: "زياد",
//       "تاريخ الميلاد": "2015-12-08",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "خلفاوي أحمد ياسين": {
//       "رقم التعريف": "1001539110109000",
//       اللقب: "خلفاوي",
//       الاسم: "أحمد ياسين",
//       "تاريخ الميلاد": "2015-10-21",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "رضواني واصف": {
//       "رقم التعريف": "1001539010033800",
//       اللقب: "رضواني",
//       الاسم: "واصف",
//       "تاريخ الميلاد": "2015-01-05",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "زغوان شروق": {
//       "رقم التعريف": "1101539110015000",
//       اللقب: "زغوان",
//       الاسم: "شروق",
//       "تاريخ الميلاد": "2015-02-01",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "سعودي نجود": {
//       "رقم التعريف": "1101539110077200",
//       اللقب: "سعودي",
//       الاسم: "نجود",
//       "تاريخ الميلاد": "2015-08-03",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "سويد مجدولين": {
//       "رقم التعريف": "1101539010397900",
//       اللقب: "سويد",
//       الاسم: "مجدولين",
//       "تاريخ الميلاد": "2015-05-11",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "سويد ميسون": {
//       "رقم التعريف": "1101539110025400",
//       اللقب: "سويد",
//       الاسم: "ميسون",
//       "تاريخ الميلاد": "2015-03-05",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "صادقي ميار": {
//       "رقم التعريف": "1101539010307000",
//       اللقب: "صادقي",
//       الاسم: "ميار",
//       "تاريخ الميلاد": "2015-04-12",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "صادقي وجدان": {
//       "رقم التعريف": "1101539110089500",
//       اللقب: "صادقي",
//       الاسم: "وجدان",
//       "تاريخ الميلاد": "2015-09-03",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "عثماني أروى": {
//       "رقم التعريف": "1101539110008000",
//       اللقب: "عثماني",
//       الاسم: "أروى",
//       "تاريخ الميلاد": "2015-01-17",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "عرعار ترتيل": {
//       "رقم التعريف": "1101539110041600",
//       اللقب: "عرعار",
//       الاسم: "ترتيل",
//       "تاريخ الميلاد": "2015-04-20",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "عشي لينة": {
//       "رقم التعريف": "1101639110019900",
//       اللقب: "عشي",
//       الاسم: "لينة",
//       "تاريخ الميلاد": "2016-02-08",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "عمان تسنيم": {
//       "رقم التعريف": "1101539180402900",
//       اللقب: "عمان",
//       الاسم: "تسنيم",
//       "تاريخ الميلاد": "2015-05-23",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "قرين إكرام": {
//       "رقم التعريف": "1101539110034800",
//       اللقب: "قرين",
//       الاسم: "إكرام",
//       "تاريخ الميلاد": "2015-04-01",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "لموشي أنيس الأخضر": {
//       "رقم التعريف": "1001539110105800",
//       اللقب: "لموشي",
//       الاسم: "أنيس الأخضر",
//       "تاريخ الميلاد": "2015-10-11",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "محمودي نهال ساجدة": {
//       "رقم التعريف": "1101539110058400",
//       اللقب: "محمودي",
//       الاسم: "نهال ساجدة",
//       "تاريخ الميلاد": "2015-06-12",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "مصباحي نور الإيمان": {
//       "رقم التعريف": "1101539110089800",
//       اللقب: "مصباحي",
//       الاسم: "نور الإيمان",
//       "تاريخ الميلاد": "2015-09-04",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "مصباحي هيثم": {
//       "رقم التعريف": "1001539010622500",
//       اللقب: "مصباحي",
//       الاسم: "هيثم",
//       "تاريخ الميلاد": "2015-08-23",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "معمري أيوب": {
//       "رقم التعريف": "1001539110092200",
//       اللقب: "معمري",
//       الاسم: "أيوب",
//       "تاريخ الميلاد": "2015-09-10",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "مناني أصيل": {
//       "رقم التعريف": "1001539110092400",
//       اللقب: "مناني",
//       الاسم: "أصيل",
//       "تاريخ الميلاد": "2015-09-10",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "منقر عبد القادر": {
//       "رقم التعريف": "1001539110018000",
//       اللقب: "منقر",
//       الاسم: "عبد القادر",
//       "تاريخ الميلاد": "2015-02-12",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "ميسي أحمد": {
//       "رقم التعريف": "1001539110123800",
//       اللقب: "ميسي",
//       الاسم: "أحمد",
//       "تاريخ الميلاد": "2015-12-04",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "ميسي أروى": {
//       "رقم التعريف": "1101539010545700",
//       اللقب: "ميسي",
//       الاسم: "أروى",
//       "تاريخ الميلاد": "2015-07-25",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "نصرات معاذ": {
//       "رقم التعريف": "1001539120080500",
//       اللقب: "نصرات",
//       الاسم: "معاذ",
//       "تاريخ الميلاد": "2015-08-03",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "هاني عبد العزيز": {
//       "رقم التعريف": "1001539110061500",
//       اللقب: "هاني",
//       الاسم: "عبد العزيز",
//       "تاريخ الميلاد": "2015-06-22",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//     "ونيس سلمى": {
//       "رقم التعريف": "1101539120694100",
//       اللقب: "ونيس",
//       الاسم: "سلمى",
//       "تاريخ الميلاد": "2015-09-17",
//       "الالتزام بآداب الاستماع والتحدّث": "",
//       "إدراك موضوع الخطاب وفِكَره الأساسيّة": "",
//       "التجاوب مع التعليمات": "",
//       "الاسترسال وسلامة لغة التّواصل ": "",
//       "توظيف الدّلالات اللفظيّة وغير اللّفظيّة ": "",
//     },
//   },
//   "خ 1 - الأداء القرائي": {
//     "أحثريب ندى": {
//       "رقم التعريف": "1101539010273900",
//       اللقب: "أحثريب",
//       الاسم: "ندى",
//       "تاريخ الميلاد": "2015-03-20",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "أحموده هيثم": {
//       "رقم التعريف": "1001539010097600",
//       اللقب: "أحموده",
//       الاسم: "هيثم",
//       "تاريخ الميلاد": "2015-01-21",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "بالاخضر رائد": {
//       "رقم التعريف": "1001539110068900",
//       اللقب: "بالاخضر",
//       الاسم: "رائد",
//       "تاريخ الميلاد": "2015-07-11",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "بالهادي أحمد طه أديب": {
//       "رقم التعريف": "1001539110130600",
//       اللقب: "بالهادي",
//       الاسم: "أحمد طه أديب",
//       "تاريخ الميلاد": "2015-12-22",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "بالهادي ريان قدوس": {
//       "رقم التعريف": "1001539110139800",
//       اللقب: "بالهادي",
//       الاسم: "ريان قدوس",
//       "تاريخ الميلاد": "2015-02-07",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "بعطوط جمال": {
//       "رقم التعريف": "1001439010818000",
//       اللقب: "بعطوط",
//       الاسم: "جمال",
//       "تاريخ الميلاد": "2014-11-03",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "بعطوط لؤي": {
//       "رقم التعريف": "1001539120091200",
//       اللقب: "بعطوط",
//       الاسم: "لؤي",
//       "تاريخ الميلاد": "2015-11-19",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "حمدان تميم": {
//       "رقم التعريف": "1001439010746000",
//       اللقب: "حمدان",
//       الاسم: "تميم",
//       "تاريخ الميلاد": "2014-10-13",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "حمدان محمد زياد": {
//       "رقم التعريف": "1001439010751100",
//       اللقب: "حمدان",
//       الاسم: "محمد زياد",
//       "تاريخ الميلاد": "2014-10-18",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "خالدي زياد": {
//       "رقم التعريف": "1001539110056700",
//       اللقب: "خالدي",
//       الاسم: "زياد",
//       "تاريخ الميلاد": "2015-12-08",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "خلفاوي أحمد ياسين": {
//       "رقم التعريف": "1001539110109000",
//       اللقب: "خلفاوي",
//       الاسم: "أحمد ياسين",
//       "تاريخ الميلاد": "2015-10-21",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "رضواني واصف": {
//       "رقم التعريف": "1001539010033800",
//       اللقب: "رضواني",
//       الاسم: "واصف",
//       "تاريخ الميلاد": "2015-01-05",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "زغوان شروق": {
//       "رقم التعريف": "1101539110015000",
//       اللقب: "زغوان",
//       الاسم: "شروق",
//       "تاريخ الميلاد": "2015-02-01",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "سعودي نجود": {
//       "رقم التعريف": "1101539110077200",
//       اللقب: "سعودي",
//       الاسم: "نجود",
//       "تاريخ الميلاد": "2015-08-03",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "سويد مجدولين": {
//       "رقم التعريف": "1101539010397900",
//       اللقب: "سويد",
//       الاسم: "مجدولين",
//       "تاريخ الميلاد": "2015-05-11",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "سويد ميسون": {
//       "رقم التعريف": "1101539110025400",
//       اللقب: "سويد",
//       الاسم: "ميسون",
//       "تاريخ الميلاد": "2015-03-05",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "صادقي ميار": {
//       "رقم التعريف": "1101539010307000",
//       اللقب: "صادقي",
//       الاسم: "ميار",
//       "تاريخ الميلاد": "2015-04-12",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "صادقي وجدان": {
//       "رقم التعريف": "1101539110089500",
//       اللقب: "صادقي",
//       الاسم: "وجدان",
//       "تاريخ الميلاد": "2015-09-03",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "عثماني أروى": {
//       "رقم التعريف": "1101539110008000",
//       اللقب: "عثماني",
//       الاسم: "أروى",
//       "تاريخ الميلاد": "2015-01-17",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "عرعار ترتيل": {
//       "رقم التعريف": "1101539110041600",
//       اللقب: "عرعار",
//       الاسم: "ترتيل",
//       "تاريخ الميلاد": "2015-04-20",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "عشي لينة": {
//       "رقم التعريف": "1101639110019900",
//       اللقب: "عشي",
//       الاسم: "لينة",
//       "تاريخ الميلاد": "2016-02-08",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "عمان تسنيم": {
//       "رقم التعريف": "1101539180402900",
//       اللقب: "عمان",
//       الاسم: "تسنيم",
//       "تاريخ الميلاد": "2015-05-23",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "قرين إكرام": {
//       "رقم التعريف": "1101539110034800",
//       اللقب: "قرين",
//       الاسم: "إكرام",
//       "تاريخ الميلاد": "2015-04-01",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "لموشي أنيس الأخضر": {
//       "رقم التعريف": "1001539110105800",
//       اللقب: "لموشي",
//       الاسم: "أنيس الأخضر",
//       "تاريخ الميلاد": "2015-10-11",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "محمودي نهال ساجدة": {
//       "رقم التعريف": "1101539110058400",
//       اللقب: "محمودي",
//       الاسم: "نهال ساجدة",
//       "تاريخ الميلاد": "2015-06-12",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "مصباحي نور الإيمان": {
//       "رقم التعريف": "1101539110089800",
//       اللقب: "مصباحي",
//       الاسم: "نور الإيمان",
//       "تاريخ الميلاد": "2015-09-04",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "مصباحي هيثم": {
//       "رقم التعريف": "1001539010622500",
//       اللقب: "مصباحي",
//       الاسم: "هيثم",
//       "تاريخ الميلاد": "2015-08-23",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "معمري أيوب": {
//       "رقم التعريف": "1001539110092200",
//       اللقب: "معمري",
//       الاسم: "أيوب",
//       "تاريخ الميلاد": "2015-09-10",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "مناني أصيل": {
//       "رقم التعريف": "1001539110092400",
//       اللقب: "مناني",
//       الاسم: "أصيل",
//       "تاريخ الميلاد": "2015-09-10",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "منقر عبد القادر": {
//       "رقم التعريف": "1001539110018000",
//       اللقب: "منقر",
//       الاسم: "عبد القادر",
//       "تاريخ الميلاد": "2015-02-12",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "ميسي أحمد": {
//       "رقم التعريف": "1001539110123800",
//       اللقب: "ميسي",
//       الاسم: "أحمد",
//       "تاريخ الميلاد": "2015-12-04",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "ميسي أروى": {
//       "رقم التعريف": "1101539010545700",
//       اللقب: "ميسي",
//       الاسم: "أروى",
//       "تاريخ الميلاد": "2015-07-25",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "نصرات معاذ": {
//       "رقم التعريف": "1001539120080500",
//       اللقب: "نصرات",
//       الاسم: "معاذ",
//       "تاريخ الميلاد": "2015-08-03",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "هاني عبد العزيز": {
//       "رقم التعريف": "1001539110061500",
//       اللقب: "هاني",
//       الاسم: "عبد العزيز",
//       "تاريخ الميلاد": "2015-06-22",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//     "ونيس سلمى": {
//       "رقم التعريف": "1101539120694100",
//       اللقب: "ونيس",
//       الاسم: "سلمى",
//       "تاريخ الميلاد": "2015-09-17",
//       "بالعادات القرائية الحسنة": "",
//       "قراءة مسترسلة لوحدات لغويّة كاملة ": "",
//       "قراءة معبّرة عن المعاني": "",
//       "احترام زمن الإنجاز (مدّة القراءة)": "",
//     },
//   },
//   "خ 1 - فهم المكتوب": {
//     "أحثريب ندى": {
//       "رقم التعريف": "1101539010273900",
//       اللقب: "أحثريب",
//       الاسم: "ندى",
//       "تاريخ الميلاد": "2015-03-20",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "أحموده هيثم": {
//       "رقم التعريف": "1001539010097600",
//       اللقب: "أحموده",
//       الاسم: "هيثم",
//       "تاريخ الميلاد": "2015-01-21",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "بالاخضر رائد": {
//       "رقم التعريف": "1001539110068900",
//       اللقب: "بالاخضر",
//       الاسم: "رائد",
//       "تاريخ الميلاد": "2015-07-11",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "بالهادي أحمد طه أديب": {
//       "رقم التعريف": "1001539110130600",
//       اللقب: "بالهادي",
//       الاسم: "أحمد طه أديب",
//       "تاريخ الميلاد": "2015-12-22",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "بالهادي ريان قدوس": {
//       "رقم التعريف": "1001539110139800",
//       اللقب: "بالهادي",
//       الاسم: "ريان قدوس",
//       "تاريخ الميلاد": "2015-02-07",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "بعطوط جمال": {
//       "رقم التعريف": "1001439010818000",
//       اللقب: "بعطوط",
//       الاسم: "جمال",
//       "تاريخ الميلاد": "2014-11-03",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "بعطوط لؤي": {
//       "رقم التعريف": "1001539120091200",
//       اللقب: "بعطوط",
//       الاسم: "لؤي",
//       "تاريخ الميلاد": "2015-11-19",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "حمدان تميم": {
//       "رقم التعريف": "1001439010746000",
//       اللقب: "حمدان",
//       الاسم: "تميم",
//       "تاريخ الميلاد": "2014-10-13",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "حمدان محمد زياد": {
//       "رقم التعريف": "1001439010751100",
//       اللقب: "حمدان",
//       الاسم: "محمد زياد",
//       "تاريخ الميلاد": "2014-10-18",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "خالدي زياد": {
//       "رقم التعريف": "1001539110056700",
//       اللقب: "خالدي",
//       الاسم: "زياد",
//       "تاريخ الميلاد": "2015-12-08",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "خلفاوي أحمد ياسين": {
//       "رقم التعريف": "1001539110109000",
//       اللقب: "خلفاوي",
//       الاسم: "أحمد ياسين",
//       "تاريخ الميلاد": "2015-10-21",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "رضواني واصف": {
//       "رقم التعريف": "1001539010033800",
//       اللقب: "رضواني",
//       الاسم: "واصف",
//       "تاريخ الميلاد": "2015-01-05",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "زغوان شروق": {
//       "رقم التعريف": "1101539110015000",
//       اللقب: "زغوان",
//       الاسم: "شروق",
//       "تاريخ الميلاد": "2015-02-01",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "سعودي نجود": {
//       "رقم التعريف": "1101539110077200",
//       اللقب: "سعودي",
//       الاسم: "نجود",
//       "تاريخ الميلاد": "2015-08-03",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "سويد مجدولين": {
//       "رقم التعريف": "1101539010397900",
//       اللقب: "سويد",
//       الاسم: "مجدولين",
//       "تاريخ الميلاد": "2015-05-11",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "سويد ميسون": {
//       "رقم التعريف": "1101539110025400",
//       اللقب: "سويد",
//       الاسم: "ميسون",
//       "تاريخ الميلاد": "2015-03-05",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "صادقي ميار": {
//       "رقم التعريف": "1101539010307000",
//       اللقب: "صادقي",
//       الاسم: "ميار",
//       "تاريخ الميلاد": "2015-04-12",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "صادقي وجدان": {
//       "رقم التعريف": "1101539110089500",
//       اللقب: "صادقي",
//       الاسم: "وجدان",
//       "تاريخ الميلاد": "2015-09-03",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "عثماني أروى": {
//       "رقم التعريف": "1101539110008000",
//       اللقب: "عثماني",
//       الاسم: "أروى",
//       "تاريخ الميلاد": "2015-01-17",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "عرعار ترتيل": {
//       "رقم التعريف": "1101539110041600",
//       اللقب: "عرعار",
//       الاسم: "ترتيل",
//       "تاريخ الميلاد": "2015-04-20",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "عشي لينة": {
//       "رقم التعريف": "1101639110019900",
//       اللقب: "عشي",
//       الاسم: "لينة",
//       "تاريخ الميلاد": "2016-02-08",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "عمان تسنيم": {
//       "رقم التعريف": "1101539180402900",
//       اللقب: "عمان",
//       الاسم: "تسنيم",
//       "تاريخ الميلاد": "2015-05-23",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "قرين إكرام": {
//       "رقم التعريف": "1101539110034800",
//       اللقب: "قرين",
//       الاسم: "إكرام",
//       "تاريخ الميلاد": "2015-04-01",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "لموشي أنيس الأخضر": {
//       "رقم التعريف": "1001539110105800",
//       اللقب: "لموشي",
//       الاسم: "أنيس الأخضر",
//       "تاريخ الميلاد": "2015-10-11",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "محمودي نهال ساجدة": {
//       "رقم التعريف": "1101539110058400",
//       اللقب: "محمودي",
//       الاسم: "نهال ساجدة",
//       "تاريخ الميلاد": "2015-06-12",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "مصباحي نور الإيمان": {
//       "رقم التعريف": "1101539110089800",
//       اللقب: "مصباحي",
//       الاسم: "نور الإيمان",
//       "تاريخ الميلاد": "2015-09-04",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "مصباحي هيثم": {
//       "رقم التعريف": "1001539010622500",
//       اللقب: "مصباحي",
//       الاسم: "هيثم",
//       "تاريخ الميلاد": "2015-08-23",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "معمري أيوب": {
//       "رقم التعريف": "1001539110092200",
//       اللقب: "معمري",
//       الاسم: "أيوب",
//       "تاريخ الميلاد": "2015-09-10",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "مناني أصيل": {
//       "رقم التعريف": "1001539110092400",
//       اللقب: "مناني",
//       الاسم: "أصيل",
//       "تاريخ الميلاد": "2015-09-10",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "منقر عبد القادر": {
//       "رقم التعريف": "1001539110018000",
//       اللقب: "منقر",
//       الاسم: "عبد القادر",
//       "تاريخ الميلاد": "2015-02-12",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "ميسي أحمد": {
//       "رقم التعريف": "1001539110123800",
//       اللقب: "ميسي",
//       الاسم: "أحمد",
//       "تاريخ الميلاد": "2015-12-04",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "ميسي أروى": {
//       "رقم التعريف": "1101539010545700",
//       اللقب: "ميسي",
//       الاسم: "أروى",
//       "تاريخ الميلاد": "2015-07-25",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "نصرات معاذ": {
//       "رقم التعريف": "1001539120080500",
//       اللقب: "نصرات",
//       الاسم: "معاذ",
//       "تاريخ الميلاد": "2015-08-03",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "هاني عبد العزيز": {
//       "رقم التعريف": "1001539110061500",
//       اللقب: "هاني",
//       الاسم: "عبد العزيز",
//       "تاريخ الميلاد": "2015-06-22",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//     "ونيس سلمى": {
//       "رقم التعريف": "1101539120694100",
//       اللقب: "ونيس",
//       الاسم: "سلمى",
//       "تاريخ الميلاد": "2015-09-17",
//       "توظيف الحصيلة اللغويّة": "",
//       "التحليل النحوي لجملة": "",
//       "التحويل الصرفي لفقرة": "",
//       "تشكيل فقرة أو تصحيحها": "",
//       "الرسم الإملائي لفقرة ": "",
//     },
//   },
//   "خ 1 - الإنتاج الكتابي": {
//     "أحثريب ندى": {
//       "رقم التعريف": "1101539010273900",
//       اللقب: "أحثريب",
//       الاسم: "ندى",
//       "تاريخ الميلاد": "2015-03-20",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "أحموده هيثم": {
//       "رقم التعريف": "1001539010097600",
//       اللقب: "أحموده",
//       الاسم: "هيثم",
//       "تاريخ الميلاد": "2015-01-21",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "بالاخضر رائد": {
//       "رقم التعريف": "1001539110068900",
//       اللقب: "بالاخضر",
//       الاسم: "رائد",
//       "تاريخ الميلاد": "2015-07-11",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "بالهادي أحمد طه أديب": {
//       "رقم التعريف": "1001539110130600",
//       اللقب: "بالهادي",
//       الاسم: "أحمد طه أديب",
//       "تاريخ الميلاد": "2015-12-22",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "بالهادي ريان قدوس": {
//       "رقم التعريف": "1001539110139800",
//       اللقب: "بالهادي",
//       الاسم: "ريان قدوس",
//       "تاريخ الميلاد": "2015-02-07",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "بعطوط جمال": {
//       "رقم التعريف": "1001439010818000",
//       اللقب: "بعطوط",
//       الاسم: "جمال",
//       "تاريخ الميلاد": "2014-11-03",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "بعطوط لؤي": {
//       "رقم التعريف": "1001539120091200",
//       اللقب: "بعطوط",
//       الاسم: "لؤي",
//       "تاريخ الميلاد": "2015-11-19",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "حمدان تميم": {
//       "رقم التعريف": "1001439010746000",
//       اللقب: "حمدان",
//       الاسم: "تميم",
//       "تاريخ الميلاد": "2014-10-13",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "حمدان محمد زياد": {
//       "رقم التعريف": "1001439010751100",
//       اللقب: "حمدان",
//       الاسم: "محمد زياد",
//       "تاريخ الميلاد": "2014-10-18",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "خالدي زياد": {
//       "رقم التعريف": "1001539110056700",
//       اللقب: "خالدي",
//       الاسم: "زياد",
//       "تاريخ الميلاد": "2015-12-08",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "خلفاوي أحمد ياسين": {
//       "رقم التعريف": "1001539110109000",
//       اللقب: "خلفاوي",
//       الاسم: "أحمد ياسين",
//       "تاريخ الميلاد": "2015-10-21",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "رضواني واصف": {
//       "رقم التعريف": "1001539010033800",
//       اللقب: "رضواني",
//       الاسم: "واصف",
//       "تاريخ الميلاد": "2015-01-05",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "زغوان شروق": {
//       "رقم التعريف": "1101539110015000",
//       اللقب: "زغوان",
//       الاسم: "شروق",
//       "تاريخ الميلاد": "2015-02-01",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "سعودي نجود": {
//       "رقم التعريف": "1101539110077200",
//       اللقب: "سعودي",
//       الاسم: "نجود",
//       "تاريخ الميلاد": "2015-08-03",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "سويد مجدولين": {
//       "رقم التعريف": "1101539010397900",
//       اللقب: "سويد",
//       الاسم: "مجدولين",
//       "تاريخ الميلاد": "2015-05-11",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "سويد ميسون": {
//       "رقم التعريف": "1101539110025400",
//       اللقب: "سويد",
//       الاسم: "ميسون",
//       "تاريخ الميلاد": "2015-03-05",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "صادقي ميار": {
//       "رقم التعريف": "1101539010307000",
//       اللقب: "صادقي",
//       الاسم: "ميار",
//       "تاريخ الميلاد": "2015-04-12",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "صادقي وجدان": {
//       "رقم التعريف": "1101539110089500",
//       اللقب: "صادقي",
//       الاسم: "وجدان",
//       "تاريخ الميلاد": "2015-09-03",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "عثماني أروى": {
//       "رقم التعريف": "1101539110008000",
//       اللقب: "عثماني",
//       الاسم: "أروى",
//       "تاريخ الميلاد": "2015-01-17",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "عرعار ترتيل": {
//       "رقم التعريف": "1101539110041600",
//       اللقب: "عرعار",
//       الاسم: "ترتيل",
//       "تاريخ الميلاد": "2015-04-20",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "عشي لينة": {
//       "رقم التعريف": "1101639110019900",
//       اللقب: "عشي",
//       الاسم: "لينة",
//       "تاريخ الميلاد": "2016-02-08",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "عمان تسنيم": {
//       "رقم التعريف": "1101539180402900",
//       اللقب: "عمان",
//       الاسم: "تسنيم",
//       "تاريخ الميلاد": "2015-05-23",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "قرين إكرام": {
//       "رقم التعريف": "1101539110034800",
//       اللقب: "قرين",
//       الاسم: "إكرام",
//       "تاريخ الميلاد": "2015-04-01",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "لموشي أنيس الأخضر": {
//       "رقم التعريف": "1001539110105800",
//       اللقب: "لموشي",
//       الاسم: "أنيس الأخضر",
//       "تاريخ الميلاد": "2015-10-11",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "محمودي نهال ساجدة": {
//       "رقم التعريف": "1101539110058400",
//       اللقب: "محمودي",
//       الاسم: "نهال ساجدة",
//       "تاريخ الميلاد": "2015-06-12",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "مصباحي نور الإيمان": {
//       "رقم التعريف": "1101539110089800",
//       اللقب: "مصباحي",
//       الاسم: "نور الإيمان",
//       "تاريخ الميلاد": "2015-09-04",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "مصباحي هيثم": {
//       "رقم التعريف": "1001539010622500",
//       اللقب: "مصباحي",
//       الاسم: "هيثم",
//       "تاريخ الميلاد": "2015-08-23",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "معمري أيوب": {
//       "رقم التعريف": "1001539110092200",
//       اللقب: "معمري",
//       الاسم: "أيوب",
//       "تاريخ الميلاد": "2015-09-10",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "مناني أصيل": {
//       "رقم التعريف": "1001539110092400",
//       اللقب: "مناني",
//       الاسم: "أصيل",
//       "تاريخ الميلاد": "2015-09-10",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "منقر عبد القادر": {
//       "رقم التعريف": "1001539110018000",
//       اللقب: "منقر",
//       الاسم: "عبد القادر",
//       "تاريخ الميلاد": "2015-02-12",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "ميسي أحمد": {
//       "رقم التعريف": "1001539110123800",
//       اللقب: "ميسي",
//       الاسم: "أحمد",
//       "تاريخ الميلاد": "2015-12-04",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "ميسي أروى": {
//       "رقم التعريف": "1101539010545700",
//       اللقب: "ميسي",
//       الاسم: "أروى",
//       "تاريخ الميلاد": "2015-07-25",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "نصرات معاذ": {
//       "رقم التعريف": "1001539120080500",
//       اللقب: "نصرات",
//       الاسم: "معاذ",
//       "تاريخ الميلاد": "2015-08-03",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "هاني عبد العزيز": {
//       "رقم التعريف": "1001539110061500",
//       اللقب: "هاني",
//       الاسم: "عبد العزيز",
//       "تاريخ الميلاد": "2015-06-22",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//     "ونيس سلمى": {
//       "رقم التعريف": "1101539120694100",
//       اللقب: "ونيس",
//       الاسم: "سلمى",
//       "تاريخ الميلاد": "2015-09-17",
//       "احترام التعليمة والمهمّات المرفقة ": "",
//       "ترابط الأفكار وتسلسلها": "",
//       "الالتزام بقواعد اللّغة": "",
//       "إدراج قيمة، أو تحديد موقف، أو إبداء رأي": "",
//       "جودة المنتج": "",
//     },
//   },
//   "خ 1 - التحكم في موارد ميادين ا": {
//     "أحثريب ندى": {
//       "رقم التعريف": "1101539010273900",
//       اللقب: "أحثريب",
//       الاسم: "ندى",
//       "تاريخ الميلاد": "2015-03-20",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "أحموده هيثم": {
//       "رقم التعريف": "1001539010097600",
//       اللقب: "أحموده",
//       الاسم: "هيثم",
//       "تاريخ الميلاد": "2015-01-21",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "بالاخضر رائد": {
//       "رقم التعريف": "1001539110068900",
//       اللقب: "بالاخضر",
//       الاسم: "رائد",
//       "تاريخ الميلاد": "2015-07-11",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "بالهادي أحمد طه أديب": {
//       "رقم التعريف": "1001539110130600",
//       اللقب: "بالهادي",
//       الاسم: "أحمد طه أديب",
//       "تاريخ الميلاد": "2015-12-22",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "بالهادي ريان قدوس": {
//       "رقم التعريف": "1001539110139800",
//       اللقب: "بالهادي",
//       الاسم: "ريان قدوس",
//       "تاريخ الميلاد": "2015-02-07",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "بعطوط جمال": {
//       "رقم التعريف": "1001439010818000",
//       اللقب: "بعطوط",
//       الاسم: "جمال",
//       "تاريخ الميلاد": "2014-11-03",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "بعطوط لؤي": {
//       "رقم التعريف": "1001539120091200",
//       اللقب: "بعطوط",
//       الاسم: "لؤي",
//       "تاريخ الميلاد": "2015-11-19",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "حمدان تميم": {
//       "رقم التعريف": "1001439010746000",
//       اللقب: "حمدان",
//       الاسم: "تميم",
//       "تاريخ الميلاد": "2014-10-13",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "حمدان محمد زياد": {
//       "رقم التعريف": "1001439010751100",
//       اللقب: "حمدان",
//       الاسم: "محمد زياد",
//       "تاريخ الميلاد": "2014-10-18",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "خالدي زياد": {
//       "رقم التعريف": "1001539110056700",
//       اللقب: "خالدي",
//       الاسم: "زياد",
//       "تاريخ الميلاد": "2015-12-08",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "خلفاوي أحمد ياسين": {
//       "رقم التعريف": "1001539110109000",
//       اللقب: "خلفاوي",
//       الاسم: "أحمد ياسين",
//       "تاريخ الميلاد": "2015-10-21",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "رضواني واصف": {
//       "رقم التعريف": "1001539010033800",
//       اللقب: "رضواني",
//       الاسم: "واصف",
//       "تاريخ الميلاد": "2015-01-05",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "زغوان شروق": {
//       "رقم التعريف": "1101539110015000",
//       اللقب: "زغوان",
//       الاسم: "شروق",
//       "تاريخ الميلاد": "2015-02-01",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "سعودي نجود": {
//       "رقم التعريف": "1101539110077200",
//       اللقب: "سعودي",
//       الاسم: "نجود",
//       "تاريخ الميلاد": "2015-08-03",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "سويد مجدولين": {
//       "رقم التعريف": "1101539010397900",
//       اللقب: "سويد",
//       الاسم: "مجدولين",
//       "تاريخ الميلاد": "2015-05-11",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "سويد ميسون": {
//       "رقم التعريف": "1101539110025400",
//       اللقب: "سويد",
//       الاسم: "ميسون",
//       "تاريخ الميلاد": "2015-03-05",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "صادقي ميار": {
//       "رقم التعريف": "1101539010307000",
//       اللقب: "صادقي",
//       الاسم: "ميار",
//       "تاريخ الميلاد": "2015-04-12",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "صادقي وجدان": {
//       "رقم التعريف": "1101539110089500",
//       اللقب: "صادقي",
//       الاسم: "وجدان",
//       "تاريخ الميلاد": "2015-09-03",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "عثماني أروى": {
//       "رقم التعريف": "1101539110008000",
//       اللقب: "عثماني",
//       الاسم: "أروى",
//       "تاريخ الميلاد": "2015-01-17",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "عرعار ترتيل": {
//       "رقم التعريف": "1101539110041600",
//       اللقب: "عرعار",
//       الاسم: "ترتيل",
//       "تاريخ الميلاد": "2015-04-20",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "عشي لينة": {
//       "رقم التعريف": "1101639110019900",
//       اللقب: "عشي",
//       الاسم: "لينة",
//       "تاريخ الميلاد": "2016-02-08",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "عمان تسنيم": {
//       "رقم التعريف": "1101539180402900",
//       اللقب: "عمان",
//       الاسم: "تسنيم",
//       "تاريخ الميلاد": "2015-05-23",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "قرين إكرام": {
//       "رقم التعريف": "1101539110034800",
//       اللقب: "قرين",
//       الاسم: "إكرام",
//       "تاريخ الميلاد": "2015-04-01",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "لموشي أنيس الأخضر": {
//       "رقم التعريف": "1001539110105800",
//       اللقب: "لموشي",
//       الاسم: "أنيس الأخضر",
//       "تاريخ الميلاد": "2015-10-11",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "محمودي نهال ساجدة": {
//       "رقم التعريف": "1101539110058400",
//       اللقب: "محمودي",
//       الاسم: "نهال ساجدة",
//       "تاريخ الميلاد": "2015-06-12",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "مصباحي نور الإيمان": {
//       "رقم التعريف": "1101539110089800",
//       اللقب: "مصباحي",
//       الاسم: "نور الإيمان",
//       "تاريخ الميلاد": "2015-09-04",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "مصباحي هيثم": {
//       "رقم التعريف": "1001539010622500",
//       اللقب: "مصباحي",
//       الاسم: "هيثم",
//       "تاريخ الميلاد": "2015-08-23",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "معمري أيوب": {
//       "رقم التعريف": "1001539110092200",
//       اللقب: "معمري",
//       الاسم: "أيوب",
//       "تاريخ الميلاد": "2015-09-10",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "مناني أصيل": {
//       "رقم التعريف": "1001539110092400",
//       اللقب: "مناني",
//       الاسم: "أصيل",
//       "تاريخ الميلاد": "2015-09-10",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "منقر عبد القادر": {
//       "رقم التعريف": "1001539110018000",
//       اللقب: "منقر",
//       الاسم: "عبد القادر",
//       "تاريخ الميلاد": "2015-02-12",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "ميسي أحمد": {
//       "رقم التعريف": "1001539110123800",
//       اللقب: "ميسي",
//       الاسم: "أحمد",
//       "تاريخ الميلاد": "2015-12-04",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "ميسي أروى": {
//       "رقم التعريف": "1101539010545700",
//       اللقب: "ميسي",
//       الاسم: "أروى",
//       "تاريخ الميلاد": "2015-07-25",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "نصرات معاذ": {
//       "رقم التعريف": "1001539120080500",
//       اللقب: "نصرات",
//       الاسم: "معاذ",
//       "تاريخ الميلاد": "2015-08-03",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "هاني عبد العزيز": {
//       "رقم التعريف": "1001539110061500",
//       اللقب: "هاني",
//       الاسم: "عبد العزيز",
//       "تاريخ الميلاد": "2015-06-22",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//     "ونيس سلمى": {
//       "رقم التعريف": "1101539120694100",
//       اللقب: "ونيس",
//       الاسم: "سلمى",
//       "تاريخ الميلاد": "2015-09-17",
//       "التحكم في الأعداد الأصغر من 000 000 1و الأعداد العشرية، وتمثيل الكسور والحساب.":
//         "",
//       "التحكم في العلاقات الموجودة بين وحدات القياس، ورسم أشكال هندسية بسيطة وحساب المساحة والمحيط ":
//         "",
//       "التحكم في استخراج وتنظيم وتمثيل المعطيات واستعمال الخواص الخطية للتناسبية ":
//         "",
//     },
//   },
//   "خ 1 - تملّك الموارد المنهجية ل": {
//     "أحثريب ندى": {
//       "رقم التعريف": "1101539010273900",
//       اللقب: "أحثريب",
//       الاسم: "ندى",
//       "تاريخ الميلاد": "2015-03-20",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "أحموده هيثم": {
//       "رقم التعريف": "1001539010097600",
//       اللقب: "أحموده",
//       الاسم: "هيثم",
//       "تاريخ الميلاد": "2015-01-21",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "بالاخضر رائد": {
//       "رقم التعريف": "1001539110068900",
//       اللقب: "بالاخضر",
//       الاسم: "رائد",
//       "تاريخ الميلاد": "2015-07-11",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "بالهادي أحمد طه أديب": {
//       "رقم التعريف": "1001539110130600",
//       اللقب: "بالهادي",
//       الاسم: "أحمد طه أديب",
//       "تاريخ الميلاد": "2015-12-22",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "بالهادي ريان قدوس": {
//       "رقم التعريف": "1001539110139800",
//       اللقب: "بالهادي",
//       الاسم: "ريان قدوس",
//       "تاريخ الميلاد": "2015-02-07",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "بعطوط جمال": {
//       "رقم التعريف": "1001439010818000",
//       اللقب: "بعطوط",
//       الاسم: "جمال",
//       "تاريخ الميلاد": "2014-11-03",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "بعطوط لؤي": {
//       "رقم التعريف": "1001539120091200",
//       اللقب: "بعطوط",
//       الاسم: "لؤي",
//       "تاريخ الميلاد": "2015-11-19",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "حمدان تميم": {
//       "رقم التعريف": "1001439010746000",
//       اللقب: "حمدان",
//       الاسم: "تميم",
//       "تاريخ الميلاد": "2014-10-13",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "حمدان محمد زياد": {
//       "رقم التعريف": "1001439010751100",
//       اللقب: "حمدان",
//       الاسم: "محمد زياد",
//       "تاريخ الميلاد": "2014-10-18",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "خالدي زياد": {
//       "رقم التعريف": "1001539110056700",
//       اللقب: "خالدي",
//       الاسم: "زياد",
//       "تاريخ الميلاد": "2015-12-08",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "خلفاوي أحمد ياسين": {
//       "رقم التعريف": "1001539110109000",
//       اللقب: "خلفاوي",
//       الاسم: "أحمد ياسين",
//       "تاريخ الميلاد": "2015-10-21",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "رضواني واصف": {
//       "رقم التعريف": "1001539010033800",
//       اللقب: "رضواني",
//       الاسم: "واصف",
//       "تاريخ الميلاد": "2015-01-05",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "زغوان شروق": {
//       "رقم التعريف": "1101539110015000",
//       اللقب: "زغوان",
//       الاسم: "شروق",
//       "تاريخ الميلاد": "2015-02-01",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "سعودي نجود": {
//       "رقم التعريف": "1101539110077200",
//       اللقب: "سعودي",
//       الاسم: "نجود",
//       "تاريخ الميلاد": "2015-08-03",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "سويد مجدولين": {
//       "رقم التعريف": "1101539010397900",
//       اللقب: "سويد",
//       الاسم: "مجدولين",
//       "تاريخ الميلاد": "2015-05-11",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "سويد ميسون": {
//       "رقم التعريف": "1101539110025400",
//       اللقب: "سويد",
//       الاسم: "ميسون",
//       "تاريخ الميلاد": "2015-03-05",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "صادقي ميار": {
//       "رقم التعريف": "1101539010307000",
//       اللقب: "صادقي",
//       الاسم: "ميار",
//       "تاريخ الميلاد": "2015-04-12",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "صادقي وجدان": {
//       "رقم التعريف": "1101539110089500",
//       اللقب: "صادقي",
//       الاسم: "وجدان",
//       "تاريخ الميلاد": "2015-09-03",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "عثماني أروى": {
//       "رقم التعريف": "1101539110008000",
//       اللقب: "عثماني",
//       الاسم: "أروى",
//       "تاريخ الميلاد": "2015-01-17",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "عرعار ترتيل": {
//       "رقم التعريف": "1101539110041600",
//       اللقب: "عرعار",
//       الاسم: "ترتيل",
//       "تاريخ الميلاد": "2015-04-20",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "عشي لينة": {
//       "رقم التعريف": "1101639110019900",
//       اللقب: "عشي",
//       الاسم: "لينة",
//       "تاريخ الميلاد": "2016-02-08",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "عمان تسنيم": {
//       "رقم التعريف": "1101539180402900",
//       اللقب: "عمان",
//       الاسم: "تسنيم",
//       "تاريخ الميلاد": "2015-05-23",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "قرين إكرام": {
//       "رقم التعريف": "1101539110034800",
//       اللقب: "قرين",
//       الاسم: "إكرام",
//       "تاريخ الميلاد": "2015-04-01",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "لموشي أنيس الأخضر": {
//       "رقم التعريف": "1001539110105800",
//       اللقب: "لموشي",
//       الاسم: "أنيس الأخضر",
//       "تاريخ الميلاد": "2015-10-11",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "محمودي نهال ساجدة": {
//       "رقم التعريف": "1101539110058400",
//       اللقب: "محمودي",
//       الاسم: "نهال ساجدة",
//       "تاريخ الميلاد": "2015-06-12",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "مصباحي نور الإيمان": {
//       "رقم التعريف": "1101539110089800",
//       اللقب: "مصباحي",
//       الاسم: "نور الإيمان",
//       "تاريخ الميلاد": "2015-09-04",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "مصباحي هيثم": {
//       "رقم التعريف": "1001539010622500",
//       اللقب: "مصباحي",
//       الاسم: "هيثم",
//       "تاريخ الميلاد": "2015-08-23",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "معمري أيوب": {
//       "رقم التعريف": "1001539110092200",
//       اللقب: "معمري",
//       الاسم: "أيوب",
//       "تاريخ الميلاد": "2015-09-10",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "مناني أصيل": {
//       "رقم التعريف": "1001539110092400",
//       اللقب: "مناني",
//       الاسم: "أصيل",
//       "تاريخ الميلاد": "2015-09-10",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "منقر عبد القادر": {
//       "رقم التعريف": "1001539110018000",
//       اللقب: "منقر",
//       الاسم: "عبد القادر",
//       "تاريخ الميلاد": "2015-02-12",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "ميسي أحمد": {
//       "رقم التعريف": "1001539110123800",
//       اللقب: "ميسي",
//       الاسم: "أحمد",
//       "تاريخ الميلاد": "2015-12-04",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "ميسي أروى": {
//       "رقم التعريف": "1101539010545700",
//       اللقب: "ميسي",
//       الاسم: "أروى",
//       "تاريخ الميلاد": "2015-07-25",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "نصرات معاذ": {
//       "رقم التعريف": "1001539120080500",
//       اللقب: "نصرات",
//       الاسم: "معاذ",
//       "تاريخ الميلاد": "2015-08-03",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "هاني عبد العزيز": {
//       "رقم التعريف": "1001539110061500",
//       اللقب: "هاني",
//       الاسم: "عبد العزيز",
//       "تاريخ الميلاد": "2015-06-22",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//     "ونيس سلمى": {
//       "رقم التعريف": "1101539120694100",
//       اللقب: "ونيس",
//       الاسم: "سلمى",
//       "تاريخ الميلاد": "2015-09-17",
//       "فهم المشكلة الرياضياتية": "",
//       "انسجام عناصر حل المشكلة الرياضياتية": "",
//       "الاستعمال السليم للأدوات الرياضياتية": "",
//       "التبليغ الرياضياتي": "",
//     },
//   },
// };

//
type ComboCriteriaProps = {
  criteria: string[];
  SelectNumber: (index: number) => void;
};
function ComboCriteria({ criteria, SelectNumber }: ComboCriteriaProps) {
  const handleChange = (e: React.ChangeEvent<HTMLSelectElement>) => {
    const selectedValue = e.target.value;
    const selectedIndex = criteria.findIndex((c) => c === selectedValue);
    SelectNumber(selectedIndex);
  };

  return (
    <div className="mb-3 text-black bg-amber-100">
      <select
        onChange={handleChange}
        className="form-select"
        aria-label="Default select example"
      >
        <option value="" disabled selected>
          اختر معيارا
        </option>
        {criteria.map((criterion, index) => (
          <option key={index} value={criterion}>
            {criterion}
          </option>
        ))}
      </select>
    </div>
  );
}

const subjects = [
  "تربية إسلامية",
  "اللغة العربية",
  "الرياضيات",
  "اللغة الفرنسية",
  "اللغة الإنجليزية",
  "التربية المدنية",
  "التربية العلمية",
  "التربية التشكيلية",
  "التربية الموسيقية",
  "التربية البدنية",
  "التربية التكنولوجية",
];
function ArabicForm() {


  // الحالات المحفوظة
  const [wilaya, setWilaya] = useState('');
  const [school, setSchool] = useState('');
  const [selectedSubject, setSelectedSubject] = useState(subjects[1]);
  const [skillText, setSkillText] = useState('');
  const [season, setSeason] = useState('');
  const [teacher, setTeacher] = useState('');

  // تحميل البيانات عند أول مرة
  useEffect(() => {
    const storedWilaya = localStorage.getItem('wilaya') || '';
    const storedSchool = localStorage.getItem('school') || '';
    const storedSubject = localStorage.getItem('subject') || subjects[1];
    const storedSkillText = localStorage.getItem('skillText') || '';
    const storedSeason = localStorage.getItem('season') || '';
    const storedTeacher = localStorage.getItem('teacher') || '';

    console.log("Loaded values:", { storedWilaya, storedSchool, storedSubject, storedSkillText, storedSeason, storedTeacher });

    setWilaya(storedWilaya);
    setSchool(storedSchool);
    setSelectedSubject(storedSubject);
    setSkillText(storedSkillText);
    setSeason(storedSeason);
    setTeacher(storedTeacher);
  }, []);

  // حفظ البيانات عند التغيير
  useEffect(() => {
    console.log("Saving values:", { wilaya, school, selectedSubject, skillText, season, teacher });

    localStorage.setItem('wilaya', wilaya);
    localStorage.setItem('school', school);
    localStorage.setItem('subject', selectedSubject);
    localStorage.setItem('skillText', skillText);
    localStorage.setItem('season', season);
    localStorage.setItem('teacher', teacher);
  }, [wilaya, school, selectedSubject, skillText, season, teacher]);

  return (
    <div dir="rtl" className="flex justify-between items-start font-bold text-[16px] p-4 gap-4 text-black">
      {/* المقاطعة والابتدائية */}
      <div className="border-2 border-cyan-500 rounded-xl p-3 bg-gray-100">
        <div className="flex items-center gap-1 mb-2">
          <label>مقاطعة:</label>
          <input
            type="text"
            dir="rtl"
            placeholder="..."
            value={wilaya}
            onChange={(e) => setWilaya(e.target.value)}
            className="text-right text-black border-none outline-none bg-transparent w-32"
          />
        </div>
        <div className="flex items-center gap-1">
          <label>ابتدائية:</label>
          <input
            type="text"
            dir="rtl"
            placeholder="..."
            value={school}
            onChange={(e) => setSchool(e.target.value)}
            className="text-right text-black border-none outline-none bg-transparent w-40"
          />
        </div>
      </div>

      {/* الشبكة التحليلية */}
      <div className="border-2 border-red-500 rounded-xl p-3 bg-gray-100 text-center">
        <div className="mb-2">
          <span>الشبكة التحليلية لتقييم الكفاءات الختامية لمادة</span>{" "}
          <select
            dir="rtl"
            value={selectedSubject}
            onChange={(e) => setSelectedSubject(e.target.value)}
            className="text-center text-black border-none outline-none bg-transparent w-40"
          >
            {subjects.map((subject) => (
              <option key={subject} value={subject}>
                {subject}
              </option>
            ))}
          </select>
        </div>

        {/* كفاءة فهم المكتوب */}
        <div>
          <input
            type="text"
            dir="rtl"
            placeholder="كفاءة فهم المكتوب"
            value={skillText}
            onChange={(e) => setSkillText(e.target.value)}
            className="text-center text-black border-none outline-none bg-transparent w-60"
          />
        </div>

        <div className="mt-4"></div>
      </div>

      {/* الموسم الدراسي والأستاذ */}
      <div className="border-2 border-cyan-500 rounded-xl p-3 bg-gray-100">
        <div className="flex items-center gap-1 mb-2">
          <label>الموسم الدراسي:</label>
          <input
            type="text"
            dir="rtl"
            placeholder="2025/2024"
            value={season}
            onChange={(e) => setSeason(e.target.value)}
            className="text-right text-black border-none outline-none bg-transparent w-24"
          />
        </div>
        <div className="flex items-center gap-1">
          <label>الأستاذ:</label>
          <input
            type="text"
            dir="rtl"
            placeholder="..."
            value={teacher}
            onChange={(e) => setTeacher(e.target.value)}
            className="text-right text-black border-none outline-none bg-transparent w-32"
          />
        </div>
      </div>
    </div>
  );
}

